Tekla Open API Reference for Tekla Structures 2025
ProjectInfo Properties
The ProjectInfo type exposes the following members.
Properties
Name | Description
Address
 The address information of the ProjectInfo.
Builder
 The builder information of the ProjectInfo.
Country
 The address country information of the ProjectInfo.
Description
 The description of the ProjectInfo.
Designer
 The designer information of the ProjectInfo.
EndDate
 The end date information of the ProjectInfo.
GUID
 The GUID field of the ProjectInfo.
Info1
 The Info 1 field of the ProjectInfo.
Info2
 The Info 2 field of the ProjectInfo.
Location
 The address location information of the ProjectInfo.
ModelSharingLocalPath |  Obsolete.
 The local folder for model sharing. Is null if not defined for the model.
ModelSharingServerPath |  Obsolete.
 The server path for model sharing. Is null if not defined for the model.
Name
 The name information of the ProjectInfo.
Object
 The object information of the ProjectInfo.
PostalBox
 The address postal box information of the ProjectInfo.
PostalCode
 The address postal code information of the ProjectInfo.
ProjectNumber
 The project number information of the ProjectInfo.
Region
 The address region information of the ProjectInfo.
StartDate
 The start date information of the ProjectInfo.
Town
 The address town information of the ProjectInfo.
Top
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace